label eggs1:
    $start_plot()
    scene black
    stop music
    "…"
    "……"
    "…………"
    play music audio.cured
    "是什么时候意识到自己的情感和思想是被干涉过的呢？"
    "你以为你做出来的决定和脑袋里涌动的想法是受大脑全权掌控的，就算冲动也是因为感情也是大脑生成的东西而已。"
    "之前在莓博看到一个现实充实的帅哥，经常分享自己的日常照，偶尔还会发一些角度比较有趣的白袜照。"
    "虽然我对脚或是袜子什么的不感兴趣，但我还是对着手机屏幕上的图像自慰起来。"
    "大脑识别眼前的白色区域为白色的袜子，而袜子下面便是和他腿部颜色相当的脚爪。"
    "如果可以的话，真想伸出舌头将那布料濡湿啊，再闻一闻，是有点上头的臭味，还是淡淡的汗味呢…"
    "我的手快速撸动着以及挺起的阳具，此时此刻我意识到这和平时不太一样，身体有一种做好了准备的感觉。"
    "没有花哨的按压或是摩擦，我只是用手一遍一遍地紧握茎身上下摩擦，同时用另一只手看着屏幕上的他的脸和白袜以及结实的小腿。"
    "想…想舔他的阴茎。"
    "好想。"
    "虽然我能看见的仅是纯黑色的短裤，但我的脑中重复着这个念头，同时构建出勃起的阴茎的图像。"
    "上翘的肉棒随着呼吸抽动着，顶端还粘附着透明的水珠。"
    "我不自觉地半张开嘴，伸出舌头，仿佛舔着什么，又或者是仅仅做这个动作会让我感觉很舒服。"
    "在我反复的刺激和意淫中，今晚的自慰指标也终于达成了。"
    "比平时还多的液体喷涌而出，与前列腺液均匀融合的精液顺滑又大量地溅射在肚子上。"
    "几乎是此刻，那些性幻想便如同断了电一样瞬间消失了。"
    "白袜的照片不再能够联系上欲望，而他的脸在我看来也变成只是普通人的长相了。"
    "我用湿毛巾清理好黏在毛上的液体，再对着他其他的照片翻看时，突然就完全找不出任何能引起我性欲的地方了。"
    "被动产生的激素影响了我的想法，这是我一定程度上没法控制的。"
    "换句话来说，如果注射某种特定的激素，就有可能让思想朝向特定的方向？"
    "那么这种控制想法的技术也可以被称之为…“洗脑”。"
    scene consulting_room with fade
    "…"
    "那只沙漠狼刚刚离开，去药房取每周都会被我微调配方的新的药物。"
    "看来他一直很相信我，坚信药物的保质期只有七天，这才让我有机会给予他不同的药物。"
    "抱歉，Solitus，我利用了你。"
    "但这也能让我们的研究更进一步，你的牺牲完全是值得的。"
    $end_plot()
    $Achievement299.achieve()
    $Achievement.show()
    return