label ending0:
    $rollback_switch()
    play music audio.impendingdeath
    "是啊。"
    "我已经厌倦了每天吃药了。"
    "这种生活就是完全的折磨。"
    scene elevator with fade
    menu:
        "7楼：天台":
            pass
    scene rooftop with fade
    "所以呢？这就是我的人生？"
    "我深呼吸。"
    "令人意外的是这座医院的天台居然这么容易就可以走楼梯上来。"
    "周边空无一人，不过毕竟这个地方平时怎么会有人呢？"
    "天台的风将我的毛发吹起。"
    "我的痛苦却永无止境，但此刻我就可以解脱了。"
    "所以我就要死了，就要失去对这具身体的掌控权了。"
    "我会觉得可惜吗？"
    "……"
    "去他妈的，这破烂身体，这操蛋的头疼，凭什么我生来就要遭受这样的痛苦。"
    "生在了科技发达的现代，又被告知没有办法治愈。"
    "为什么？为什么我要比别人痛苦啊！"
    "为什么我来到这个世界就要被这样对待啊？"
    "为什么……为什么……"
    "……"
    "我离开了天台。"
    scene falling with dissolve    
    "我喜欢这种被引力完全掌控身体的感觉，我的身躯正在向下坠落。"
    "有那么一瞬间，从头部传来的痛苦消失了。"
    "啊……"
    "是的，这种感觉……太棒{nw}"
    scene black
    play sound audio.suicide
    show screen freeze(5)
    pause
    "{color=#FF0000}Bad Ending 0.\n——愿令人怀念的新生的你，能有一个好的结局。{/color}" 
    $rollback_switch()
    return

label ending1:
    
    $rollback_switch()
    play music audio.impendingdeath
    "是啊。"
    "我已经厌倦了每天起早吃药了。"
    "这种生活就是完全的折磨。"
    "我放下手中的药瓶，望向出租房的落地窗。"
    scene suicide
    "微亮的天空将星光和晨曦倒进屋内。"
    "深呼吸。"
    "是的，这个世界真的很美，不是吗？"
    "但是她带给我的恶意实在太大了，我已经无法承受这些了。"
    "小时候的自己的形象突然浮现于脑海中，还有在餐桌旁聊天的父母，一起吃着精致的饭菜。"
    "现在他们都不在我身边了，而现在的我也只能在这小小的出租屋里独活。"
    "生命和死亡的意义已经不重要了，重要的是，我真的已经受够了。"
    "大脑深处开始浮现某种熟悉的痛苦。"
    "像被切开头骨，用带刺的木棍反复打击大脑。"
    "……"
    "即便是这种疼痛，我也能轻而易举地忍受住了啊。"
    "不过我最好快点动身。"
    "我走下床，打开窗户。"
    "还未迎来黎明的空气是如此冰冷。"
    "但黎明总会到来，我的痛苦却永无止境，不是吗？"
    "我踩着窗台，从窗口伸出头来。"
    "是的，钢铁丛林。"
    "22层，相当于多高的树呢？"
    "不过这都不重要了。"
    "一切都不重要了。"
    "我深呼吸，然后爬出窗口。"
    "大概是冷风的原因，头疼似乎正在逐渐缓解。"
    s"“现在我离这个世界更近了。”"
    "所以我就要死了，就要失去对这具身体的掌控权了。"
    "我会觉得可惜吗？"
    "……"
    "去他妈的，这破烂身体，这操蛋的头疼，凭什么我生来就要遭受这样的痛苦。"
    "生在了科技发达的现代，又被告知没有办法治愈。"
    "为什么？为什么我要比别人痛苦啊！"
    "为什么我来到这个世界就要被这样对待啊？"
    "为什么……为什么……"
    "……"
    "我离开了平台。"
    "我喜欢这种被引力完全掌控身体的感觉，我的身躯正在向下坠落。"
    "有那么一瞬间，从头部传来的痛苦消失了。"
    "啊……"
    "是的，这种感觉……太棒{nw}"
    scene black
    play sound audio.suicide
    show screen freeze(5)
    pause
    "{color=#FF0000}Bad Ending 1.\n——死亡是最好的解药。{/color}" 
    $rollback_switch()
    return


label ending2:
    
    $rollback_switch()
    "我把手伸向闹钟边的药瓶。"
    "当爪子握住塑料瓶身时，某种奇怪的感觉从爪心传递至大脑。"
    "怎么回事。"
    "怎么，怎么会如此地轻，为什么握在手里的时候没有发出熟悉的药片互相碰撞的响声。"
    "不，甚至连一粒都不剩了吗？"
    play music audio.impendingdeath
    "汗液迅速分泌，紧迫感让困意瞬间全无。"
    "某种恐惧感突然缠绕整个身躯。"
    "大脑深处开始浮现某种熟悉的痛苦。"
    "像被切开头骨，用带刺的木棍反复打击大脑。"
    "而我却已经没有任何手段回应这种从小至大折磨我的痛苦。"
    "不，不不不不不…"
    "为什么，为什么会这样…"
    "……"
    "冷静，冷静。"
    "怎么可能吃完了，怎么可能。"
    "昨天就没有了吗？还是我吃药的时候不小心弄丢了…"
    "不对，这…我……"
    "我还可以买，买一点…"
    "现在是周几？……"
    "不，没有意义了，就算是周五，现在的我要想爬起床，抱着随时都会昏迷的危险出门也是不可能的。"
    "不…不该是这样的…我…"
    "大脑内核传来的痛苦愈发扩大，像生了千万只蛆虫在内部啃咬。"
    "不不不不不不不不不不不不不不不不不不不不…"
    "啊……啊啊啊………！"
    "痛苦越来越强大，逐渐蔓延全身。"
    "…"
    "不…不行…我还有要做的事…"
    "坚持，就坚持一小会…坚持到医院急诊…"
    "我抓起手机，突然意识到自己的手正在发抖。"
    "和死亡擦肩而过的感觉并不好，但我已经习惯了那种恐惧。"
    "可当它真真切切贴近时，这种熟悉感便如同巨兽将整个精神吞噬。"
    "我拿起手机。点开紧急拨号。"
    "颤抖的手指已经不听使唤，强忍住想要撕裂大脑的痛苦拨下急救电话。"
    "…"
    $_skipping=False
    "“这里是急救中心。”"
    "“请问你的位…{nw}”"
    play music audio.interruption
    scene black
    play sound audio.drop
    show screen freeze(5)
    stop music fadeout 10
    pause
    "{color=#FF0000}Bad Ending 2.\n——你失去了活着的权利。{/color}"
    $rollback_switch()
    $_skipping=True
    return

label ne:
    
    $rollback_switch()
    "{color=#9500ff}Normal End.\n——希望我们已经死去，那样我们就将不会彼此吞食。{/color}" 
    $persistent.ne = True
    $rollback_switch()
    return

label te:
    
    $rollback_switch()
    stop music
    scene black
    pause
    play music solitus fadein 5.0
    "那场特大地震摧毁了整个a市，这个高楼林立的城市现在已经看不到五层以上的建筑了。"
    "所有伤员都被安置到了临近的b市医院，也包括我。"
    "政府拨款付了所有伤员的治疗费用，本就没多少钱的我也能被分配到一个单人病房。"
    "我是在那件事件发生的三天之后的深夜中醒来的。"
    "逃离梦魇的我如同于极度缺氧中苏醒的溺水者，大口呼吸着可能转瞬即逝的氧气。"
    "直到我慌乱的目光扫过自身所处的环境后才逐渐平静，却又在视线越过病房的巨大玻璃窗，注视着天空的群星时。"
    "也许是想到了什么，也许是因为痛苦，或者是什么乱七八糟的东西。"
    "才无可自拔地大哭了起来。"
    scene trueend with fade
    "第二天的下午，一只灰狼进入了我的病房，提着一袋水果和一大束鲜花。"
    "正是那位把我救起来的消防员。"
    "我对水果并不感兴趣，对花也是。"
    "我赶他出去，但他执意要呆在这里，坐在我床边的木凳子上，拿小刀帮我一圈一圈地削着苹果。"
    "他说他叫Decay，第一次作为消防员出任务就赶上如此可怕的大灾难。"
    "经验不足的他不如其他消防员那样能迅速地找到伤员。"
    "但只有他找到了我，而且他在这场救援之中也就只拯救了我一个人。"
    "他说，他听到了我的心跳。"
    "可笑，那么远，怎么能听到我的心跳声呢？"
    s"“那我可真要谢谢你啊，我的救命恩人。你想从我这里得到什么？”"
    decay"“…我知道你现在心情不好。”"
    "他递给我削好的苹果。"
    "他说他很珍视我，因为我是他唯一救起来的人，虽然被救的人千千万，但他坚持认为，我对于他有什么特殊的意义。"
    "所以希望我快点好起来。"
    "我并没有受太重的伤，在重新补充了能量和水之后就没有大碍了。"
    "我接过苹果，挪到嘴边，开始咀嚼。"
    "他说，在把我从废墟下抱出来后，发现我即便神志不清也要用手指着废墟中的另一人。"
    "或者说，尸体。"
    "那具和我一起躺着的尸体已经死亡了好几天了，死亡原因是建筑碎片断裂的钢筋条插进下腹部导致的失血而死，但检查过后，他发现那尸体口中有混杂着白色药物颗粒的液体。"
    "他问我那是什么。"
    "我说。"
    s"“那是强效止痛药。”"
    "……"
    s"“我有很严重的偏头痛，随时都会带很多止痛药。”"
    s"“我以为他还活着，于是每天都给他灌一粒，怕他先于痛苦而不是失血而死。”"
    decay"“可他死亡怎么说也应该有一周多了，而把你救起来那天，他的嘴里还有没有融化完全的药。”"
    s"“……”"
    "我不知道该说什么。"
    "复杂的情绪在我脑叶中散开，刺痛每条和我一同幸存的神经。"
    s"“……应该是我不知道，或者不相信他早就死了的这个事实吧。”"
    s"“就连我都差点没能捡回这条命，更别说伤势那么重的他了。”"
    decay"“他是你的，同事吗？”"
    "…"
    "我思考了一会，看向他。"
    s"“是，仅仅是今天才认识的同事，他才第一天来我们公司。”"
    decay"“可怜。但地震也是没办法的事，没必要因为一个普通朋友那么伤心，要重新打起精神来啊。”"
    "我把苹果核放在桌子上。"
    stop music fadeout 10.0
    s"“总之，谢谢你的苹果。”"
    s"“也谢谢你。”"
    decay"“不用谢，这都是我应该做的。”"
    "……"
    "“Do the candles look forward to being used?”\n（蜡烛是否正期待着被使用？）"
    "“Enjoy bidding adieu, adieu?”\n（是否正争相期待着告别时刻？）"
    "“Every word I have saved for you came out wrong afterwards.”\n（每一句为你而留的话语都成为了谬言。）"
    "“Would you say,”\n（你认为，）"
    "“That someone who had every intention to be brave was a coward?”\n（那无时无刻不期待着成为勇者的人，会是个懦夫吗？）"
    "“Must be great being you,”\n（如果能成为你就好了，）"
    "“Power comes as second nature,”\n（勇气就如同你的天性，）"
    "“Must feel amazing to be longed for, longed for.”\n（如果能成为你就好了。）"
    "“So which home should someone as weak as I go?”\n（像我这样懦弱的人，又有哪里可做归宿呢？）"
    "“And which sky should I aim for when I\'ve only been low?”\n（当我消沉的时候，又该去往哪一片天空之下呢？）"
    "我看向蔚蓝的天空，仿佛现在还是四五年前，我坐在大学教室的最后一排，对着和现在一样蓝的天空做不切实际的白日梦。"
    show screen freeze(3)
    pause
    "{color=#9500ff}True End.\n——在列车中，我牵着你的尸体的手，一同走到车厢尽头。{/color}" 
    $persistent.te = True
    $rollback_switch()
    return
